package telegramTasks.categoryBegin;

public class CircleUtil {

    public static void main(String[] args) {

        // Задача 22: Дан диаметр окружности d. Найти
        // ее длину L=π*d. В качестве значения π использовать 3.14

        double d = 1293.2d;
        double l = 3.14 * d;
        System.out.println(l);

    }

}
